# FabricationRoutingSolutionsUiParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationRoutingSolutionsUiParam Property
ParameterTypeId Class See Also
---
"x of XX"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationRoutingSolutionsUiParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationRoutingSolutionsUiParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationRoutingSolutionsUiParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace